tap "hashicorp/tap"
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "ansible"
brew "awscli"
brew "bat"
brew "osx-cpu-temp"
brew "bpytop"
brew "colordiff"
brew "duf"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "git"
brew "git-delta"
brew "htop"
brew "hugo"
brew "mas"
brew "mise"
brew "mono-libgdiplus"
brew "neovim", args: ["HEAD"]
brew "oci-cli"
brew "php"
brew "ripgrep"
brew "safe-rm"
brew "starship"
brew "tmux"
brew "tree"
brew "xdg-ninja"
brew "yadm"
brew "zlib"
brew "hashicorp/tap/terraform"
cask "arc"
cask "balenaetcher"
cask "cursor"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "font-hack-nerd-font"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mono-mdk"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "vial"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
cask "webex"
cask "wezterm"
cask "xquartz"
cask "zed"
cask "zoom"
cask "zotero"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
