tap "hashicorp/tap"
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "ansible"
brew "awscli"
brew "bat"
brew "osx-cpu-temp"
brew "bpytop"
brew "colordiff"
brew "cpanminus"
brew "duf"
brew "eza"
brew "fd"
brew "figlet"
brew "fzf"
brew "git"
brew "git-delta"
brew "htop"
brew "hugo"
brew "mas"
brew "mise"
brew "mono-libgdiplus"
brew "neovim", args: ["HEAD"]
brew "oci-cli"
brew "perl"
brew "php"
brew "ripgrep"
brew "safe-rm"
brew "starship"
brew "tmux"
brew "tree"
brew "xdg-ninja"
brew "yadm"
brew "zlib"
brew "hashicorp/tap/terraform"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "arc"
cask "balenaetcher"
cask "cursor"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "elecom-mouse-util"
cask "font-batang"
cask "font-hack-nerd-font"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mono-mdk"
cask "raspberry-pi-imager"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "vial"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
cask "webex"
cask "wezterm"
cask "xquartz"
cask "zed"
cask "zoom"
cask "zotero"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "aeschli.vscode-css-formatter"
vscode "christian-kohler.path-intellisense"
vscode "esbenp.prettier-vscode"
vscode "eservice-online.vs-sharper"
vscode "foxundermoon.shell-format"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "lpubsppop01.vscode-auto-timestamp"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saikou9901.evilinspector"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
