tap "osx-cross/avr"
tap "qmk/qmk"
brew "tree"
brew "ansible"
brew "awscli"
brew "bat"
brew "osx-cpu-temp"
brew "bpytop"
brew "cbc"
brew "cmake"
brew "colordiff"
brew "cpanminus"
brew "docker", link: false
brew "docker-compose"
brew "doxygen"
brew "duf"
brew "eza"
brew "fd"
brew "figlet"
brew "gh"
brew "git"
brew "gnupg"
brew "graphviz"
brew "gum"
brew "helix"
brew "htop"
brew "libheif"
brew "mas"
brew "mingw-w64"
brew "mise"
brew "mono-libgdiplus"
brew "oci-cli"
brew "perl"
brew "php"
brew "pinentry-mac"
brew "pkgconf"
brew "ripgrep"
brew "safe-rm"
brew "tmux"
brew "xdg-ninja"
brew "yadm"
brew "zlib"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "arc"
cask "autodesk-fusion"
cask "balenaetcher"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk"
cask "dropbox"
cask "elecom-mouse-util"
cask "font-batang"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mono-mdk"
cask "obsidian"
cask "raspberry-pi-imager"
cask "scroll-reverser"
cask "slack"
cask "thebrowsercompany-dia"
cask "vial"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
cask "webex"
cask "wezterm"
cask "xquartz"
cask "zed"
cask "zoom"
cask "zotero"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "aeschli.vscode-css-formatter"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "eservice-online.vs-sharper"
vscode "foxundermoon.shell-format"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lpubsppop01.vscode-auto-timestamp"
vscode "masterustacean.leptos-fmt"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saikou9901.evilinspector"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
